{
  "_name_or_path": "",
  "architectures": [
    "RQVAESIGLIPTransformer"
  ],
  "hidden_size": 1152,
  "model_type": "rqvaesigliptransformer_model",
  "rqvaesiglip": {
    "architectures": [
      "RQVAESiglip"
    ],
    "layer_recon": 6,
    "layer_sem": 26,
    "layer_shortcut": 4,
    "weight_shortcut": 0.6,
    "model_type": "rqvaesiglip_model",
    "hidden_size": 1152,
    "ddconfig": {
      "attn_resolutions": [
        24
      ],
      "ch": 128,
      "ch_mult": [
        1,
        1,
        4,
        4,
        8
      ],
      "decoder_in_channels": 1024,
      "double_z": false,
      "dropout": 0.0,
      "in_channels": 3,
      "num_res_blocks": 2,
      "out_ch": 3,
      "resolution": 384
    },
    "decoder_latent_shape": [24, 24],
    "checkpointing": true,
    "ignore_keys": null,
    "vq_sem": {
      "bottleneck_type": "rq_ema",
      "ckpt_path": null,
      "code_shape": [
        27,
        27,
        8
      ],
      "decay": 0.99,
      "embed_dim": 32,
      "latent_shape": [
        27,
        27,
        32
      ],
      "n_embed": 16384,
      "restart_unused_codes": true,
      "shared_codebook": true
    },
    "vq_pix": {
      "bottleneck_type": "rq",
      "ckpt_path": null,
      "code_shape": [
        27,
        27,
        8
      ],
      "decay": 0.99,
      "embed_dim": 32,
      "latent_shape": [
        27,
        27,
        32
      ],
      "n_embed": 16384,
      "restart_unused_codes": true,
      "shared_codebook": true
    },
    "pretrained_model": "/mnt/public/users/songwei/model_zoo/siglip2-so400m-patch14-384",
    "torch_dtype": "float32",
    "transformers_version": "4.50.3"
  },
  "transformers_version": "4.50.3"
}
